{"backend": "tensorflow", "config": [{"config": {"name": "conv2d_7", "batch_input_shape": [null, 128, 128, 3], "use_bias": true, "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "filters": 1, "trainable": true, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_7", "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_8", "batch_input_shape": [null, 128, 128, 3], "use_bias": true, "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "filters": 1, "trainable": true, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_8", "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_5", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_11", "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 128, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_12", "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 128, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_13", "use_bias": true, "activation": "sigmoid", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 1, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.5"}